app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= form.label :author, style: "display: block" %>
    <%= collection_select(:book, :author_id, Author.all, :id, :name, prompt: true) %>