app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "birth_year", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "icse"], ["birth_year", 1940], ["created_at", "2024-07-23 06:46:02.347840"], ["updated_at", "2024-07-23 06:46:02.347840"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save