app/controllers/books_controller.rb

INSERT INTO "books" ("title", "published_year", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Treasure Trove"], ["published_year", 1999], ["created_at", "2024-07-23 06:33:54.043807"], ["updated_at", "2024-07-23 06:33:54.043807"], ["author_id", nil]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "published_year" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["published_year", 1998], ["updated_at", "2024-07-23 06:56:11.414081"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)